# Используем официальный образ Golang в качестве базового
FROM golang:1.22

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем файлы go.mod и go.sum в рабочую директорию контейнера
COPY go.mod go.sum ./

# Загружаем зависимости, указанные в go.mod и go.sum
RUN go mod download

# Копируем все файлы с расширением .go в рабочую директорию контейнера
COPY *.go ./

# Копируем файл базы данных в рабочую директорию контейнера
COPY tracker.db ./

# Собираем Go-приложение с отключенной поддержкой CGO для Linux AMD64
RUN CGO_ENABLED=0 GOOS=linux GOARCH=amd64 go build -o /my_app

# Устанавливаем команду по умолчанию для запуска при старте контейнера
CMD ["/my_app"]
